tap "cloudflare/cloudflare"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "hybridgroup/tools"
tap "stripe/stripe-cli"
brew "ack"
brew "gdbm"
brew "readline"
brew "xz"
brew "b2-tools"
brew "bison"
brew "cmake"
brew "dfu-util"
brew "exif"
brew "exiftool"
brew "gh"
brew "git"
brew "git-lfs"
brew "gmp"
brew "libffi"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "gphoto2"
brew "hugo"
brew "jq"
brew "ledger"
brew "libyaml"
brew "lynx"
brew "mas"
brew "nghttp2"
brew "ninja"
brew "pinentry-mac"
brew "protobuf"
brew "pth"
brew "qrencode"
brew "redis"
brew "ruby"
brew "rbenv"
brew "ruby-build"
brew "rust"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watch", link: false
brew "watchman"
brew "wget"
brew "xpdf"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "cloudflare/cloudflare/cloudflared"
brew "heroku/brew/heroku"
brew "stripe/stripe-cli/stripe"
cask "arduino"
cask "basecamp"
cask "carbon-copy-cloner"
cask "chromedriver"
cask "docker"
cask "elgato-control-center"
cask "firefox"
cask "google-chrome"
cask "netnewswire"
cask "postgres"
cask "retrobatch"
cask "sf-symbols"
mas "1Blocker", id: 1107421413
mas "1Password 7", id: 1333542190
mas "Developer", id: 640199958
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Logic Pro X", id: 634148309
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Playgrounds", id: 1496833156
mas "Tailscale", id: 1475387142
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
