tap "cloudflare/cloudflare"
tap "crunchydata/brew"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "stripe/stripe-cli"
# Search tool like grep, but optimized for programmers
brew "ack"
# General-purpose data compression with high compression ratio
brew "xz"
# B2 Cloud Storage Command-Line Tools
brew "b2-tools"
# Parser generator
brew "bison"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# USB programmer
brew "dfu-util"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Command-line tool to interact with exercism.io
brew "exercism"
# Read, write, modify, and display EXIF data on the command-line
brew "exif"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# GNU multiple precision arithmetic library
brew "gmp"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# X.509 and CMS library
brew "libksba"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-line interface to libgphoto2
brew "gphoto2"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line, double-entry accounting tool
brew "ledger"
# Library that provides automatic proxy configuration management
brew "libproxy"
# YAML Parser
brew "libyaml"
# Text-based web browser
brew "lynx"
# Mac App Store command-line interface
brew "mas"
# HTTP/2 C Library
brew "nghttp2"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# GNU Portable THreads
brew "pth"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# QR Code generation
brew "qrencode"
# Cross-platform application and UI framework
brew "qt"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Safe, concurrent, practical language
brew "rust"
# Database of common MIME types
brew "shared-mime-info"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# PDF viewer
brew "xpdf"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
# CLI for Crunchy Bridge
brew "crunchydata/brew/cb"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Electronics prototyping platform
cask "arduino"
# Data backup and storage service
cask "backblaze"
# All-In-One Toolkit for Working Remotely
cask "basecamp"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# App to build and share containerized applications and microservices
cask "docker"
# Control your Elgato key lights
cask "elgato-control-center"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Free and open-source RSS reader
cask "netnewswire"
# App wrapper for Postgres
cask "postgres-unofficial"
# Batch image processor
cask "retrobatch"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Install and switch between multiple versions of Xcode
cask "xcodes"
mas "1Blocker", id: 1365531024
mas "com.kirsteins.chords-and-scales-mac", id: 1435473426
mas "Developer", id: 640199958
mas "field kit", id: 1612653346
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastel", id: 413897608
mas "Pixelmator Pro", id: 1289583905
mas "Playgrounds", id: 1496833156
mas "Tailscale", id: 1475387142
mas "Tokenary", id: 1375542355
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
